doc/s-sql-f.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:45 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples F</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples F</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0ed97df">S-SQL Examples Home Page</a></li>
<li><a href="#fetch">Fetch</a></li>
<li><a href="#filter">Filter</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0ed97df" class="outline-2">
<h2 id="org0ed97df"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org0ed97df">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-fetch" class="outline-2">
<h2 id="fetch">Fetch</h2>
<div class="outline-text-2" id="text-fetch">
<p>
Fetch is a more efficient way to do pagination instead of using limit and
offset. Fetch allows you to retrieve a limited set of rows, optionally offset
by a specified number of rows. In order to ensure this works correctly, you
should use the order-by clause. If the amount is not provided, it assumes
you only want to return 1 row.
<a href="https://www.postgresql.org/docs/current/sql-select.html">https://www.postgresql.org/docs/current/sql-select.html</a>
</p>

<p>
Examples:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:fetch</span> (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> 'id <span class="org-builtin">:from</span> 'historical-events) 'id) 5))

((1) (2) (3) (4) (5))

(query (<span class="org-builtin">:fetch</span> (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> 'id <span class="org-builtin">:from</span> 'historical-events) 'id) 5 10))

((11) (12) (13) (14) (15))
</pre>
</div>
</div>
</div>

<div id="outline-container-filter" class="outline-2">
<h2 id="filter">Filter</h2>
<div class="outline-text-2" id="text-filter">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> (<span class="org-builtin">:count</span> '* <span class="org-builtin">:distinct</span>) 'unfiltered)
                (<span class="org-builtin">:as</span> (<span class="org-builtin">:count</span> '* <span class="org-builtin">:filter</span> (<span class="org-builtin">:=</span> 1 'bid))
                     'filtered)
                <span class="org-builtin">:from</span> 'testtable))
</pre>
</div>
<p>
Note that, if used, the filter must be last in the count args. If distinct
is used, it must come before filter. Unlike standard sql, the word 'where'
is not used inside the filter clause. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:count</span> '*)
                (<span class="org-builtin">:count</span> '* <span class="org-builtin">:filter</span> (<span class="org-builtin">:=</span> 1 'bid))
                'id
                <span class="org-builtin">:from</span> 'pbbench-history))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>